In [1]:
%matplotlib notebook

In [2]:
import pandas as pd
import matplotlib as plt

In [ ]:
# Bernt's code starts here

In [ ]:
# Importing necessary dataframes

birthrate_csv = "../project-one/Resources/children_per_woman_total_fertility.csv"
birthrate_df = pd.read_csv(birthrate_csv)
birthrate_df.head()

In [8]:
co2_csv = "../project-one/Resources/co2_emissions_tonnes_per_person.csv"
co2_df = pd.read_csv(co2_csv)
co2_df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0529,0.0637,0.0854,0.154,0.242,0.294,0.412,0.35,0.316,0.299
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.3800,1.2800,1.3000,1.460,1.480,1.560,1.790,1.68,1.730,1.960
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.2200,2.9900,3.1900,3.160,3.420,3.300,3.290,3.46,3.510,3.720
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,7.3000,6.7500,6.5200,6.430,6.120,6.120,5.870,5.92,5.900,5.830
4,Angola,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.9800,1.1000,1.2000,1.180,1.230,1.240,1.250,1.33,1.250,1.290

In [3]:
income_csv = "../project-one/Resources/income_per_person_gdppercapita_ppp_inflation_adjusted.csv"
income_df = pd.read_csv(income_csv)
income_df.head()
# units are in dollars, I believe

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2031,2032,2033,2034,2035,2036,2037,2038,2039,2040
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,2420,2470,2520,2580,2640,2700,2760,2820,2880,2940
1,Albania,667,667,667,667,667,668,668,668,668,...,18500,18900,19300,19700,20200,20600,21100,21500,22000,22500
2,Algeria,715,716,717,718,719,720,721,722,723,...,15600,15900,16300,16700,17000,17400,17800,18200,18600,19000
3,Andorra,1200,1200,1200,1200,1210,1210,1210,1210,1220,...,73200,74800,76400,78100,79900,81600,83400,85300,87200,89100
4,Angola,618,620,623,626,628,631,634,637,640,...,6270,6410,6550,6700,6850,7000,7150,7310,7470,7640

In [ ]:
population_csv = "../project-one/Resources/population_total.csv"
population_df = pd.read_csv(population_csv)
population_df.head()

In [ ]:
# For reference only:
# these are the years we are interested in:  [1804, 1834, 1864, 1894, 1824, 1954, 1984, and 2014]

In [ ]:
# Step 2: Merge the data...BUT FIRST!! To prep for an inner join (where the only data merged is
# whatever matches in our reference columns), we can dropna() first, and then merge

# Removing "not a number's"

#birthrate_df = birthrate_df.dropna()
#co2_df = co2_df.dropna()

In [ ]:
# Step 3: Clean the data (dropna, isolate the specific year columns we're interested in)

In [ ]:
# Step 4: Plot our data with CO2 emissions on the x-axis, and birthrate on the y-axis
# BONUS: try formatting dot size by population or income level

In [ ]:
# Bernt's code ends here

In [ ]:
# Kaan's code starts here

In [ ]:
# Kaan's code ends here

In [ ]:
# Molly's code starts here

1864 work

In [ ]:
#pull out 1864 birthrate per country
birthrate_1864_df = birthrate_df[["country", "1864"]]
birthrate_1864_df.head()

In [ ]:
#pull out 1864 CO2 per country
co2_1864_df = co2_df[["country", "1864"]]
co2_1864_df.head()

In [ ]:
#merge co2 and birthrate for 1864
merge_brate_co2_1864_df = pd.merge(birthrate_1864_df,co2_1864_df, on="country", how="right")
merge_brate_co2_1864_df = merge_brate_co2_1864_df.dropna()
merge_brate_co2_1864_df.head()

In [ ]:
#rename the columns
renamed_df=merge_brate_co2_1864_df.rename(columns={"1864_x":"1864 Birthrate", "1864_y":"1864 CO2"})
renamed_df.head()

In [ ]:
#Molly--continue to merge the dataframes so you ultimately have one dataframe with a column for each 
#data (population and income). Then make a scatter plot to see what that looks like -- think about other
#plots that would make sense and what other questions to ask

In [ ]:
#pull out 1864 income for each country
income_1864_df = income_df[["country", "1864"]]
income_1864_df.head()

In [ ]:
#pull out the 1864 population for each country
pop_1864_df = population_df[["country", "1864"]]
pop_1864_df.head()

In [ ]:
#merge income and population for 1864
merge_inc_pop_1864_df = pd.merge(income_1864_df,pop_1864_df, on="country", how="right")
merge_inc_pop_1864_df = merge_inc_pop_1864_df.dropna()
merge_inc_pop_1864_df.head()

In [ ]:
#rename the columns
renamedPI_df=merge_inc_pop_1864_df.rename(columns={"1864_x":"1864 income", "1864_y":"1864 population"})
renamedPI_df.head()

In [ ]:
#merge all 4 for 1864
merge_all_1864_df = pd.merge(renamedPI_df,renamed_df, on="country", how="right")
merge_all_1864_df

In [ ]:
#Then make a scatter plot to see what that looks like -- think about other plots that would make 
# sense and what other questions to ask

1894 work

In [ ]:
#pull out 1894 birthrate per country
birthrate_1894_df = birthrate_df[["country", "1894"]]
birthrate_1894_df

In [ ]:
#pull out 1894 CO2 per country
co2_1894_df = co2_df[["country", "1894"]]
co2_1894_df

In [ ]:
#merge co2 and birthrate for 1894
merge_brate_co2_1894_df = pd.merge(birthrate_1894_df,co2_1894_df, on="country", how="right")
#merge_brate_co2_1894_df = merge_brate_co2_1894_df.dropna()
len(merge_brate_co2_1894_df)

In [ ]:
#rename the columns
renamed94a_df=merge_brate_co2_1894_df.rename(columns={"1894_x":"1894 Birthrate", "1894_y":"1894 CO2"})
renamed94a_df.head()

In [ ]:
#pull out 1894 income for each country
income_1894_df = income_df[["country", "1894"]]
income_1894_df.head()

In [ ]:
#pull out the 1894 population for each country
pop_1894_df = population_df[["country", "1894"]]
pop_1894_df.head()

In [ ]:
#merge income and population for 1894
merge_inc_pop_1894_df = pd.merge(income_1894_df,pop_1894_df, on="country", how="inner")
merge_inc_pop_1894_df = merge_inc_pop_1894_df.dropna()
merge_inc_pop_1894_df

In [ ]:
#rename the columns
renamedPI94_df=merge_inc_pop_1894_df.rename(columns={"1894_x":"1894 income", "1894_y":"1894 population"})
renamedPI94_df.head()

In [ ]:
#can the join type change to get more data?
#merge all 4 for 1894
merge_all_1894_df = pd.merge(renamedPI94_df,renamed94a_df, on="country", how="inner")
merge_all_1894_df

In [4]:
income_df.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2031,2032,2033,2034,2035,2036,2037,2038,2039,2040
0,Afghanistan,603,603,603,603,603,603,603,603,603,...,2420,2470,2520,2580,2640,2700,2760,2820,2880,2940
1,Albania,667,667,667,667,667,668,668,668,668,...,18500,18900,19300,19700,20200,20600,21100,21500,22000,22500
2,Algeria,715,716,717,718,719,720,721,722,723,...,15600,15900,16300,16700,17000,17400,17800,18200,18600,19000
3,Andorra,1200,1200,1200,1200,1210,1210,1210,1210,1220,...,73200,74800,76400,78100,79900,81600,83400,85300,87200,89100
4,Angola,618,620,623,626,628,631,634,637,640,...,6270,6410,6550,6700,6850,7000,7150,7310,7470,7640

In [6]:
#can I pivot the income dataframe to show every Country|Year with the income for that year
df_unpivotedInc =income_df.melt(id_vars=['country'], var_name='year', value_name='income')
df_unpivotedInc

           country  year  income
0      Afghanistan  1800     603
1          Albania  1800     667
2          Algeria  1800     715
3          Andorra  1800    1200
4           Angola  1800     618
...            ...   ...     ...
46508    Venezuela  2040   17600
46509      Vietnam  2040   12300
46510        Yemen  2040    3960
46511       Zambia  2040    6590
46512     Zimbabwe  2040    3210

[46513 rows x 3 columns]

In [ ]:
#talked to Dom. SUggested I make a giant dataframe that has Year as the index. Then columns would be Country, Income, 
#CO2 (or whatever). Then make a new column that computes the ratio of Income to CO2. Then make anoterh dataframe 
#for each country. Then plot year and ratio using a line chart.Then you could look at the richest/poorest/least populous 
#countries on a couple different charts

In [17]:
#can I pivot the co2 dataframe to show every Country|Year with the co2 for that year
df_unpivotedCO2 =co2_df.melt(id_vars=['country'], var_name='year', value_name='co2')
df_unpivotedCO2 = df_unpivotedCO2.dropna()
df_unpivotedCO2

              country  year      co2
30             Canada  1800  0.00568
63            Germany  1800  0.03480
136            Poland  1800  0.04280
182    United Kingdom  1800  2.16000
183     United States  1800  0.03720
...               ...   ...      ...
41275       Venezuela  2014  6.03000
41276         Vietnam  2014  1.80000
41277           Yemen  2014  0.86500
41278          Zambia  2014  0.28800
41279        Zimbabwe  2014  0.78000

[16844 rows x 3 columns]

In [25]:
#turns out I don't need to concat the country and year because I don't need to label to points that are plotted. So when
#I merge the 2 unpivoted dataframes I can then do the plot. Then maybe I can do regression to see what's up there.
country = pd.Series(df_unpivotedCO2['country'])
year = pd.Series(df_unpivotedCO2['year'])
pd.concat([country, year],ignore_index=True)

0                Canada
1               Germany
2                Poland
3        United Kingdom
4         United States
              ...
33683              2014
33684              2014
33685              2014
33686              2014
33687              2014
Length: 33688, dtype: object

In [24]:
#didn't work--come back to this after you fix the concat
#merge the unpivoted 1894 dataframes
merge_1894_df = pd.merge(df_unpivotedInc,df_unpivotedCO2, on="country", how="inner")
merge_1894_df

             country year_x  income year_y      co2
0        Afghanistan   1800     603   1949  0.00191
1        Afghanistan   1800     603   1950  0.01090
2        Afghanistan   1800     603   1951  0.01170
3        Afghanistan   1800     603   1952  0.01150
4        Afghanistan   1800     603   1953  0.01320
...              ...    ...     ...    ...      ...
4057471     Zimbabwe   2040    3210   2010  0.55200
4057472     Zimbabwe   2040    3210   2011  0.66500
4057473     Zimbabwe   2040    3210   2012  0.53000
4057474     Zimbabwe   2040    3210   2013  0.77600
4057475     Zimbabwe   2040    3210   2014  0.78000

[4057476 rows x 5 columns]

In [ ]:
#then merge those two pivots and plot all those points using income as X and co2 as Y

In [ ]:
# Molly's code stops here

In [ ]:
# Vallie's code starts here

In [ ]:
# Vallie's code stops here